<?php

$UNDERQL['rule']['uql_fail_messages'] = array(

    'length'   => 'قيمة %s تجاوزت الحد الأقصى المسموح به وهو %d',
    'required' => '%s قيمة مطلوبة ويجب إدخالها',
    'number'   => 'يجب عليك وضع قيمة رقمية في %s',
    'symbol'  => 'يجب عليك وضع قيمة تمثل رموز فقط في %s',
    'between'  => 'قيمة %s خارج الحد المسموح به من القيم',
    'hex'      => 'قيمة %s يجب أن تكون أرقام ست عشرية فقط وهي من 0 إلى 9 ومن A إلى F',
    'alpha'    => 'قيمة %s يجب أن تكون حروف إنجليزية فقط',
    'alphanum' => 'قيمة %s يجب أن تكون أرقام وحروف فقط',
    'email'    => 'قيمة %s لاتعتبر عنوان بريد إلكتروني صحيح'

);

?>

